# CLI Tools
brew "git" # Version control system
brew "bash" # Bourne Again Shell
brew "tuckr" # Symlink management for dotfiles
brew "tree" # Print folder layout
brew "tmux" # Terminal multiplexer
brew "tpm" # Tmux plugin manager
brew "fish" # Fish Shell
brew "fisher" # Plugin manager for the Fish shell
brew "neovim" # Neovim text editor
brew "macchina" # System Information like neofetch
brew "graphviz" # Required for Flamegraph etc using pprof
brew "lazygit" # Terminal UI for git commands

# AI Tools
brew "terraform-mcp-server" # Official Terraform MCP Server
brew "mcp-toolbox" # Official GenAI Toolbox for Databases from Google
brew "gemini-cli"
cask "claude-code"
cask "codex"
brew "ollama" # Local LLM runtime with OpenAI-compatible API
brew "hf" # HuggingFace CLI for model download/upload

# Core Shell Utilities (moved from mise to break circular dependency)
brew "jq" # JSON processor
brew "yq" # YAML processor
brew "gh" # GitHub CLI
brew "gitleaks" # Security scanner for git repositories
brew "zoxide" # Smart cd command
brew "fzf" # Fuzzy finder
brew "fd" # File searcher
brew "ripgrep" # Search tool using regex
brew "worktrunk"

# Additional CLI tools from current install
brew "make" # Build automation tool
brew "htop" # Interactive process viewer
brew "nmap" # Network discovery and security auditing
brew "gum" # Tool for glamorous shell scripts
brew "tokei" # Code counter based on language
brew "caddy" # Proxy CLI tool
brew "duckdb" # In-process SQL OLAP database
brew "mysql-client" # MySQL client
brew "youplot" # Command line plotting tool
brew "yt-dlp" # YouTube video downloader

# Neovim Setup
brew "luarocks" # Required for rest.nvim
brew "wget" # Required for neovim mason.nvim
brew "pngpaste" # Required for neovim clipboard
brew "coreutils"

# Yazi Dependencies
brew "ffmpeg" # Video and audio processing
brew "sevenzip" # 7-Zip is a file archiver with a high compression ratio
brew "poppler" # PDF rendering library
brew "resvg" # SVG rendering tool and library
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "yazi" # Terminal file manager written in Rust, based on async I/O
brew "tlrc" # TLDR for common terminal commands

# GUI applications — gated on HOMEBREW_GUI env var
# Set HOMEBREW_GUI=true to install desktop apps, window manager, and fonts
# Omit for headless/server setups
if ENV['HOMEBREW_GUI']
  # Fonts
  cask "font-symbols-only-nerd-font" # Symbols Nerd Font

  # Standard Apps
  cask "ghostty" # Terminal Emulator
  cask "google-chrome" # Web Browser
  cask "t3-code" # T3 Code editor
  brew "podman" # Container runtime
  brew "podman-compose" # Docker Compose for Podman
  cask "podman-desktop" # Containerisation GUI
  brew "container" # Apple Native Container CLI
  cask "maccy" # Clipboard Manager
  cask "dbngin" # Database GUI
  cask "visual-studio-code" # Code Editor

  # Window Management
  tap "nikitabobko/tap" # Tap for aerospace
  tap "FelixKratz/formulae" # Tap for borders
  cask "aerospace" # Window Manager
  brew "felixkratz/formulae/borders" # Window Highlighting
end

if ENV['HOMEBREW_WORK_APPS'] == "true"
  cask "microsoft-edge"
  cask "microsoft-teams"
end

if ENV['HOMEBREW_HOME_APPS'] == "true"
  # Taps
  tap "microsoft/mssql-release"

  # Database Drivers
  brew "mssql-tools18"
  brew "msodbcsql18"

  cask "tableplus"
  cask "google-drive"
  brew "mas" # Mac store manager

  # Mac App Store Apps
  mas "DaisyDisk", id: 411643860
  mas "Final Cut Pro", id: 424389933
end
