# CLI Tools
brew "git" # Version control system
brew "bash" # Bourne Again Shell
brew "tuckr" # Symlink management for dotfiles
brew "tree" # Print folder layout
brew "tmux" # Terminal multiplexer
brew "tpm" # Tmux plugin manager
brew "fish" # Fish Shell
brew "fisher" # Plugin manager for the Fish shell
brew "neovim" # Neovim text editor
brew "fastfetch" # System information like neofetch
brew "graphviz" # Required for Flamegraph etc using pprof
brew "lazygit" # Terminal UI for git commands

# AI Tools
cask "codex"
brew "ollama", restart_service: true # Local LLM runtime with OpenAI-compatible API
brew "hf" # HuggingFace CLI for model download/upload
brew "llama.cpp" # Local LLM inference

# Core Shell Utilities (moved from mise to break circular dependency)
brew "jq" # JSON processor
brew "yq" # YAML processor
brew "gh" # GitHub CLI
brew "gitleaks" # Security scanner for git repositories
brew "zoxide" # Smart cd command
brew "fzf" # Fuzzy finder
brew "fd" # File searcher
brew "ripgrep" # Search tool using regex
brew "worktrunk"

# Additional CLI tools from current install
brew "make" # Build automation tool
brew "btop" # Interactive process viewer
brew "nmap" # Network discovery and security auditing
brew "tokei" # Code counter based on language
brew "caddy" # Proxy CLI tool
brew "duckdb" # In-process SQL OLAP database
brew "yt-dlp" # YouTube video downloader
brew "p7zip" # 7-Zip archive utility
brew "kubernetes-cli" # kubectl
brew "shellcheck" # Shell script static analysis

# Build toolchain
brew "automake" # Build tool
brew "cmake" # Build system
brew "gcc" # GNU C compiler
brew "pkgconf" # Package compiler configuration
brew "protobuf" # Protocol buffers

# Neovim Setup
brew "luarocks" # Required for rest.nvim
brew "stylua" # Lua formatter for Neovim config
brew "wget" # Required for neovim mason.nvim
brew "pngpaste" # Required for neovim clipboard
brew "coreutils"
brew "ffmpeg" # Video and audio processing
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "resvg" # SVG rendering tool and library
brew "tlrc" # TLDR for common terminal commands

# GUI applications — gated on HOMEBREW_GUI env var
# Set HOMEBREW_GUI=true to install desktop apps, window manager, and fonts
# Omit for headless/server setups
if ENV['HOMEBREW_GUI']
  # Fonts
  cask "font-symbols-only-nerd-font" # Symbols Nerd Font
  cask "font-jetbrains-mono-nerd-font" # JetBrains Mono Nerd Font
  # psudoFont Liga Mono — manually installed from https://github.com/psudo-dev/psudofont-liga-mono (v2.2.0)
  # Not available as a brew cask; install: download .zip from releases, copy .ttf files to ~/Library/Fonts/

  # Standard Apps
  cask "ghostty" # Terminal Emulator
  cask "google-chrome" # Web Browser
  brew "podman" # Container runtime
  brew "podman-compose" # Docker Compose for Podman
  cask "podman-desktop" # Containerisation GUI
  cask "maccy" # Clipboard Manager
  cask "dbngin" # Database GUI
  cask "visual-studio-code" # Code Editor
  cask "obsidian" # Knowledge base / notes
  cask "rectangle" # Window manager
  cask "ngrok" # Tunneling

  # Window Management
  tap "nikitabobko/tap" # Tap for aerospace
  tap "FelixKratz/formulae" # Tap for borders
  cask "aerospace" # Window Manager
  brew "felixkratz/formulae/borders" # Window Highlighting
end

if ENV['HOMEBREW_WORK_APPS'] == "true"
  cask "microsoft-edge"
  cask "microsoft-teams"
end

if ENV['HOMEBREW_HOME_APPS'] == "true"
  # Taps
  tap "microsoft/mssql-release"

  # Database Drivers
  brew "mssql-tools18"
  brew "msodbcsql18"

  cask "tableplus"
  brew "mas" # Mac store manager

  # Mac App Store Apps
  mas "DaisyDisk", id: 411643860
  mas "Final Cut Pro", id: 424389933
  mas "Xcode", id: 497799835
  mas "Apple Configurator", id: 1037126344
  mas "Developer", id: 640199958
  mas "Keynote", id: 409183694
  mas "Numbers", id: 409203825
  mas "Pages", id: 409201541
  mas "TestFlight", id: 899247664
  mas "WireGuard", id: 1451685025

  # LaTeX
  cask "mactex" # Full TeX distribution
end
